artilleryTest.yml
config:
  target: "http://54.183.184.112"
  phases:
    - duration: 10
      arrivalRate: 60
  processor: "./my-functions.js"

scenarios:
    - flow:
      # call generateRandomData() to create the name, email, and password variables
      - function: "generateRandomData"
      - loop: 
        - get:
            url: "/api/restaurants/{{ id }}/overview/"
        count: 100
      # Print the data we're sending while debugging the script:
      # - log: "Sent a request to /restaurants with {{ id }}"