artilleryTest.yml
config:
  target: "http://13.56.150.174"
  phases:
    - duration: 20
      arrivalRate: 20
  processor: "./my-functions.js"

scenarios:
    - flow:
      # call generateRandomData() to create the name, email, and password variables
      - function: "generateRandomData"
      - loop: 
        - get:
            url: "/restaurants/{{ id }}/"
        count: 100
      # Print the data we're sending while debugging the script:
      # - log: "Sent a request to /restaurants with {{ id }}"